import logging

logger = logging.getLogger(__name__)

procedure_to_stage_number = {
    1559: 1,
    1566: 1,
    1560: 2,
    2312: 2,
    1490: 3,
    4330: 4,
    1562: 5,
    4331: 6,
    4332: 7,
    2308: 8,
    1675: 9,
    1640: 10,
    1641: 10
}

stage_number_to_name = {
    1: "Начало лечебной программы",
    2: "Стимуляция овуляции",
    3: "Пункция фолликулов",
    4: "Прием на 5 день после пункции",
    5: "Перенос эмбрионов",
    6: "С результатом ХГЧ",
    7: "УЗИ на 21 день",
}

preparations = {
    1: "Овитрель / Декапептил",
    2: "ХГЧ",
}
